###################################################################

# Created by write_sdc on Thu Dec 20 12:52:30 2018

###################################################################
set sdc_version 1.7

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_area 0
set_driving_cell -lib_cell INVX1TS [get_ports reset]
set_driving_cell -lib_cell INVX1TS [get_ports clk]
set_driving_cell -lib_cell INVX1TS [get_ports inputsReady]
set_driving_cell -lib_cell INVX1TS [get_ports queueEmpty]
set_driving_cell -lib_cell INVX1TS [get_ports outputsRecieved]
set_driving_cell -lib_cell INVX1TS [get_ports weightWriteEnable]
set_driving_cell -lib_cell INVX1TS [get_ports biasWriteEnable]
set_driving_cell -lib_cell INVX1TS [get_ports {WriteAddressSelect[9]}]
set_driving_cell -lib_cell INVX1TS [get_ports {WriteAddressSelect[8]}]
set_driving_cell -lib_cell INVX1TS [get_ports {WriteAddressSelect[7]}]
set_driving_cell -lib_cell INVX1TS [get_ports {WriteAddressSelect[6]}]
set_driving_cell -lib_cell INVX1TS [get_ports {WriteAddressSelect[5]}]
set_driving_cell -lib_cell INVX1TS [get_ports {WriteAddressSelect[4]}]
set_driving_cell -lib_cell INVX1TS [get_ports {WriteAddressSelect[3]}]
set_driving_cell -lib_cell INVX1TS [get_ports {WriteAddressSelect[2]}]
set_driving_cell -lib_cell INVX1TS [get_ports {WriteAddressSelect[1]}]
set_driving_cell -lib_cell INVX1TS [get_ports {WriteAddressSelect[0]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[15]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[14]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[13]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[12]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[11]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[10]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[9]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[8]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[7]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[6]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[5]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[4]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[3]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[2]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[1]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[0]}]
set_driving_cell -lib_cell INVX1TS [get_ports {queueOut[9]}]
set_driving_cell -lib_cell INVX1TS [get_ports {queueOut[8]}]
set_driving_cell -lib_cell INVX1TS [get_ports {queueOut[7]}]
set_driving_cell -lib_cell INVX1TS [get_ports {queueOut[6]}]
set_driving_cell -lib_cell INVX1TS [get_ports {queueOut[5]}]
set_driving_cell -lib_cell INVX1TS [get_ports {queueOut[4]}]
set_driving_cell -lib_cell INVX1TS [get_ports {queueOut[3]}]
set_driving_cell -lib_cell INVX1TS [get_ports {queueOut[2]}]
set_driving_cell -lib_cell INVX1TS [get_ports {queueOut[1]}]
set_driving_cell -lib_cell INVX1TS [get_ports {queueOut[0]}]
set_load -pin_load 0.005 [get_ports outputsReady]
set_load -pin_load 0.005 [get_ports dequeue]
set_load -pin_load 0.005 [get_ports {layer1Output[23]}]
set_load -pin_load 0.005 [get_ports {layer1Output[22]}]
set_load -pin_load 0.005 [get_ports {layer1Output[21]}]
set_load -pin_load 0.005 [get_ports {layer1Output[20]}]
set_load -pin_load 0.005 [get_ports {layer1Output[19]}]
set_load -pin_load 0.005 [get_ports {layer1Output[18]}]
set_load -pin_load 0.005 [get_ports {layer1Output[17]}]
set_load -pin_load 0.005 [get_ports {layer1Output[16]}]
set_load -pin_load 0.005 [get_ports {layer1Output[15]}]
set_load -pin_load 0.005 [get_ports {layer1Output[14]}]
set_load -pin_load 0.005 [get_ports {layer1Output[13]}]
set_load -pin_load 0.005 [get_ports {layer1Output[12]}]
set_load -pin_load 0.005 [get_ports {layer1Output[11]}]
set_load -pin_load 0.005 [get_ports {layer1Output[10]}]
set_load -pin_load 0.005 [get_ports {layer1Output[9]}]
set_load -pin_load 0.005 [get_ports {layer1Output[8]}]
set_load -pin_load 0.005 [get_ports {layer1Output[7]}]
set_load -pin_load 0.005 [get_ports {layer1Output[6]}]
set_load -pin_load 0.005 [get_ports {layer1Output[5]}]
set_load -pin_load 0.005 [get_ports {layer1Output[4]}]
set_load -pin_load 0.005 [get_ports {layer1Output[3]}]
set_load -pin_load 0.005 [get_ports {layer1Output[2]}]
set_load -pin_load 0.005 [get_ports {layer1Output[1]}]
set_load -pin_load 0.005 [get_ports {layer1Output[0]}]
set_max_capacitance 0.005 [get_ports reset]
set_max_capacitance 0.005 [get_ports clk]
set_max_capacitance 0.005 [get_ports inputsReady]
set_max_capacitance 0.005 [get_ports queueEmpty]
set_max_capacitance 0.005 [get_ports outputsRecieved]
set_max_capacitance 0.005 [get_ports weightWriteEnable]
set_max_capacitance 0.005 [get_ports biasWriteEnable]
set_max_capacitance 0.005 [get_ports {WriteAddressSelect[9]}]
set_max_capacitance 0.005 [get_ports {WriteAddressSelect[8]}]
set_max_capacitance 0.005 [get_ports {WriteAddressSelect[7]}]
set_max_capacitance 0.005 [get_ports {WriteAddressSelect[6]}]
set_max_capacitance 0.005 [get_ports {WriteAddressSelect[5]}]
set_max_capacitance 0.005 [get_ports {WriteAddressSelect[4]}]
set_max_capacitance 0.005 [get_ports {WriteAddressSelect[3]}]
set_max_capacitance 0.005 [get_ports {WriteAddressSelect[2]}]
set_max_capacitance 0.005 [get_ports {WriteAddressSelect[1]}]
set_max_capacitance 0.005 [get_ports {WriteAddressSelect[0]}]
set_max_capacitance 0.005 [get_ports {writeIn[15]}]
set_max_capacitance 0.005 [get_ports {writeIn[14]}]
set_max_capacitance 0.005 [get_ports {writeIn[13]}]
set_max_capacitance 0.005 [get_ports {writeIn[12]}]
set_max_capacitance 0.005 [get_ports {writeIn[11]}]
set_max_capacitance 0.005 [get_ports {writeIn[10]}]
set_max_capacitance 0.005 [get_ports {writeIn[9]}]
set_max_capacitance 0.005 [get_ports {writeIn[8]}]
set_max_capacitance 0.005 [get_ports {writeIn[7]}]
set_max_capacitance 0.005 [get_ports {writeIn[6]}]
set_max_capacitance 0.005 [get_ports {writeIn[5]}]
set_max_capacitance 0.005 [get_ports {writeIn[4]}]
set_max_capacitance 0.005 [get_ports {writeIn[3]}]
set_max_capacitance 0.005 [get_ports {writeIn[2]}]
set_max_capacitance 0.005 [get_ports {writeIn[1]}]
set_max_capacitance 0.005 [get_ports {writeIn[0]}]
set_max_capacitance 0.005 [get_ports {queueOut[9]}]
set_max_capacitance 0.005 [get_ports {queueOut[8]}]
set_max_capacitance 0.005 [get_ports {queueOut[7]}]
set_max_capacitance 0.005 [get_ports {queueOut[6]}]
set_max_capacitance 0.005 [get_ports {queueOut[5]}]
set_max_capacitance 0.005 [get_ports {queueOut[4]}]
set_max_capacitance 0.005 [get_ports {queueOut[3]}]
set_max_capacitance 0.005 [get_ports {queueOut[2]}]
set_max_capacitance 0.005 [get_ports {queueOut[1]}]
set_max_capacitance 0.005 [get_ports {queueOut[0]}]
set_max_fanout 4 [get_ports reset]
set_max_fanout 4 [get_ports clk]
set_max_fanout 4 [get_ports inputsReady]
set_max_fanout 4 [get_ports queueEmpty]
set_max_fanout 4 [get_ports outputsRecieved]
set_max_fanout 4 [get_ports weightWriteEnable]
set_max_fanout 4 [get_ports biasWriteEnable]
set_max_fanout 4 [get_ports {WriteAddressSelect[9]}]
set_max_fanout 4 [get_ports {WriteAddressSelect[8]}]
set_max_fanout 4 [get_ports {WriteAddressSelect[7]}]
set_max_fanout 4 [get_ports {WriteAddressSelect[6]}]
set_max_fanout 4 [get_ports {WriteAddressSelect[5]}]
set_max_fanout 4 [get_ports {WriteAddressSelect[4]}]
set_max_fanout 4 [get_ports {WriteAddressSelect[3]}]
set_max_fanout 4 [get_ports {WriteAddressSelect[2]}]
set_max_fanout 4 [get_ports {WriteAddressSelect[1]}]
set_max_fanout 4 [get_ports {WriteAddressSelect[0]}]
set_max_fanout 4 [get_ports {writeIn[15]}]
set_max_fanout 4 [get_ports {writeIn[14]}]
set_max_fanout 4 [get_ports {writeIn[13]}]
set_max_fanout 4 [get_ports {writeIn[12]}]
set_max_fanout 4 [get_ports {writeIn[11]}]
set_max_fanout 4 [get_ports {writeIn[10]}]
set_max_fanout 4 [get_ports {writeIn[9]}]
set_max_fanout 4 [get_ports {writeIn[8]}]
set_max_fanout 4 [get_ports {writeIn[7]}]
set_max_fanout 4 [get_ports {writeIn[6]}]
set_max_fanout 4 [get_ports {writeIn[5]}]
set_max_fanout 4 [get_ports {writeIn[4]}]
set_max_fanout 4 [get_ports {writeIn[3]}]
set_max_fanout 4 [get_ports {writeIn[2]}]
set_max_fanout 4 [get_ports {writeIn[1]}]
set_max_fanout 4 [get_ports {writeIn[0]}]
set_max_fanout 4 [get_ports {queueOut[9]}]
set_max_fanout 4 [get_ports {queueOut[8]}]
set_max_fanout 4 [get_ports {queueOut[7]}]
set_max_fanout 4 [get_ports {queueOut[6]}]
set_max_fanout 4 [get_ports {queueOut[5]}]
set_max_fanout 4 [get_ports {queueOut[4]}]
set_max_fanout 4 [get_ports {queueOut[3]}]
set_max_fanout 4 [get_ports {queueOut[2]}]
set_max_fanout 4 [get_ports {queueOut[1]}]
set_max_fanout 4 [get_ports {queueOut[0]}]
set_ideal_network [get_ports clk]
create_clock [get_ports clk]  -period 1  -waveform {0 0.5}
set_clock_uncertainty 0  [get_clocks clk]
set_clock_transition -max -rise 0.01 [get_clocks clk]
set_clock_transition -max -fall 0.01 [get_clocks clk]
set_clock_transition -min -rise 0.01 [get_clocks clk]
set_clock_transition -min -fall 0.01 [get_clocks clk]
set_input_delay -clock clk  0.05  [get_ports reset]
set_input_delay -clock clk  0.05  [get_ports inputsReady]
set_input_delay -clock clk  0.05  [get_ports queueEmpty]
set_input_delay -clock clk  0.05  [get_ports outputsRecieved]
set_input_delay -clock clk  0.05  [get_ports weightWriteEnable]
set_input_delay -clock clk  0.05  [get_ports biasWriteEnable]
set_input_delay -clock clk  0.05  [get_ports {WriteAddressSelect[9]}]
set_input_delay -clock clk  0.05  [get_ports {WriteAddressSelect[8]}]
set_input_delay -clock clk  0.05  [get_ports {WriteAddressSelect[7]}]
set_input_delay -clock clk  0.05  [get_ports {WriteAddressSelect[6]}]
set_input_delay -clock clk  0.05  [get_ports {WriteAddressSelect[5]}]
set_input_delay -clock clk  0.05  [get_ports {WriteAddressSelect[4]}]
set_input_delay -clock clk  0.05  [get_ports {WriteAddressSelect[3]}]
set_input_delay -clock clk  0.05  [get_ports {WriteAddressSelect[2]}]
set_input_delay -clock clk  0.05  [get_ports {WriteAddressSelect[1]}]
set_input_delay -clock clk  0.05  [get_ports {WriteAddressSelect[0]}]
set_input_delay -clock clk  0.05  [get_ports {writeIn[15]}]
set_input_delay -clock clk  0.05  [get_ports {writeIn[14]}]
set_input_delay -clock clk  0.05  [get_ports {writeIn[13]}]
set_input_delay -clock clk  0.05  [get_ports {writeIn[12]}]
set_input_delay -clock clk  0.05  [get_ports {writeIn[11]}]
set_input_delay -clock clk  0.05  [get_ports {writeIn[10]}]
set_input_delay -clock clk  0.05  [get_ports {writeIn[9]}]
set_input_delay -clock clk  0.05  [get_ports {writeIn[8]}]
set_input_delay -clock clk  0.05  [get_ports {writeIn[7]}]
set_input_delay -clock clk  0.05  [get_ports {writeIn[6]}]
set_input_delay -clock clk  0.05  [get_ports {writeIn[5]}]
set_input_delay -clock clk  0.05  [get_ports {writeIn[4]}]
set_input_delay -clock clk  0.05  [get_ports {writeIn[3]}]
set_input_delay -clock clk  0.05  [get_ports {writeIn[2]}]
set_input_delay -clock clk  0.05  [get_ports {writeIn[1]}]
set_input_delay -clock clk  0.05  [get_ports {writeIn[0]}]
set_input_delay -clock clk  0.05  [get_ports {queueOut[9]}]
set_input_delay -clock clk  0.05  [get_ports {queueOut[8]}]
set_input_delay -clock clk  0.05  [get_ports {queueOut[7]}]
set_input_delay -clock clk  0.05  [get_ports {queueOut[6]}]
set_input_delay -clock clk  0.05  [get_ports {queueOut[5]}]
set_input_delay -clock clk  0.05  [get_ports {queueOut[4]}]
set_input_delay -clock clk  0.05  [get_ports {queueOut[3]}]
set_input_delay -clock clk  0.05  [get_ports {queueOut[2]}]
set_input_delay -clock clk  0.05  [get_ports {queueOut[1]}]
set_input_delay -clock clk  0.05  [get_ports {queueOut[0]}]
set_output_delay -clock clk  0.05  [get_ports outputsReady]
set_output_delay -clock clk  0.05  [get_ports dequeue]
set_output_delay -clock clk  0.05  [get_ports {layer1Output[23]}]
set_output_delay -clock clk  0.05  [get_ports {layer1Output[22]}]
set_output_delay -clock clk  0.05  [get_ports {layer1Output[21]}]
set_output_delay -clock clk  0.05  [get_ports {layer1Output[20]}]
set_output_delay -clock clk  0.05  [get_ports {layer1Output[19]}]
set_output_delay -clock clk  0.05  [get_ports {layer1Output[18]}]
set_output_delay -clock clk  0.05  [get_ports {layer1Output[17]}]
set_output_delay -clock clk  0.05  [get_ports {layer1Output[16]}]
set_output_delay -clock clk  0.05  [get_ports {layer1Output[15]}]
set_output_delay -clock clk  0.05  [get_ports {layer1Output[14]}]
set_output_delay -clock clk  0.05  [get_ports {layer1Output[13]}]
set_output_delay -clock clk  0.05  [get_ports {layer1Output[12]}]
set_output_delay -clock clk  0.05  [get_ports {layer1Output[11]}]
set_output_delay -clock clk  0.05  [get_ports {layer1Output[10]}]
set_output_delay -clock clk  0.05  [get_ports {layer1Output[9]}]
set_output_delay -clock clk  0.05  [get_ports {layer1Output[8]}]
set_output_delay -clock clk  0.05  [get_ports {layer1Output[7]}]
set_output_delay -clock clk  0.05  [get_ports {layer1Output[6]}]
set_output_delay -clock clk  0.05  [get_ports {layer1Output[5]}]
set_output_delay -clock clk  0.05  [get_ports {layer1Output[4]}]
set_output_delay -clock clk  0.05  [get_ports {layer1Output[3]}]
set_output_delay -clock clk  0.05  [get_ports {layer1Output[2]}]
set_output_delay -clock clk  0.05  [get_ports {layer1Output[1]}]
set_output_delay -clock clk  0.05  [get_ports {layer1Output[0]}]
