###################################################################

# Created by write_sdc on Thu Dec 20 13:07:45 2018

###################################################################
set sdc_version 1.7

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_area 0
set_driving_cell -lib_cell INVX1TS [get_ports reset]
set_driving_cell -lib_cell INVX1TS [get_ports masterClk]
set_driving_cell -lib_cell INVX1TS [get_ports inputsInbound]
set_driving_cell -lib_cell INVX1TS [get_ports predictionRecieved]
set_driving_cell -lib_cell INVX1TS [get_ports inputPixel]
set_driving_cell -lib_cell INVX1TS [get_ports weightWriteEnable]
set_driving_cell -lib_cell INVX1TS [get_ports biasWriteEnable]
set_driving_cell -lib_cell INVX1TS [get_ports LayerWriteSelect]
set_driving_cell -lib_cell INVX1TS [get_ports {WriteAddressSelect[9]}]
set_driving_cell -lib_cell INVX1TS [get_ports {WriteAddressSelect[8]}]
set_driving_cell -lib_cell INVX1TS [get_ports {WriteAddressSelect[7]}]
set_driving_cell -lib_cell INVX1TS [get_ports {WriteAddressSelect[6]}]
set_driving_cell -lib_cell INVX1TS [get_ports {WriteAddressSelect[5]}]
set_driving_cell -lib_cell INVX1TS [get_ports {WriteAddressSelect[4]}]
set_driving_cell -lib_cell INVX1TS [get_ports {WriteAddressSelect[3]}]
set_driving_cell -lib_cell INVX1TS [get_ports {WriteAddressSelect[2]}]
set_driving_cell -lib_cell INVX1TS [get_ports {WriteAddressSelect[1]}]
set_driving_cell -lib_cell INVX1TS [get_ports {WriteAddressSelect[0]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[63]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[62]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[61]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[60]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[59]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[58]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[57]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[56]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[55]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[54]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[53]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[52]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[51]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[50]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[49]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[48]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[47]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[46]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[45]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[44]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[43]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[42]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[41]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[40]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[39]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[38]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[37]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[36]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[35]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[34]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[33]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[32]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[31]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[30]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[29]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[28]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[27]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[26]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[25]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[24]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[23]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[22]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[21]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[20]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[19]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[18]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[17]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[16]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[15]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[14]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[13]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[12]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[11]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[10]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[9]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[8]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[7]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[6]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[5]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[4]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[3]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[2]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[1]}]
set_driving_cell -lib_cell INVX1TS [get_ports {writeIn[0]}]
set_load -pin_load 0.005 [get_ports predictionReady]
set_load -pin_load 0.005 [get_ports readyForInputs]
set_load -pin_load 0.005 [get_ports {predictionOut[3]}]
set_load -pin_load 0.005 [get_ports {predictionOut[2]}]
set_load -pin_load 0.005 [get_ports {predictionOut[1]}]
set_load -pin_load 0.005 [get_ports {predictionOut[0]}]
set_max_capacitance 0.005 [get_ports reset]
set_max_capacitance 0.005 [get_ports masterClk]
set_max_capacitance 0.005 [get_ports inputsInbound]
set_max_capacitance 0.005 [get_ports predictionRecieved]
set_max_capacitance 0.005 [get_ports inputPixel]
set_max_capacitance 0.005 [get_ports weightWriteEnable]
set_max_capacitance 0.005 [get_ports biasWriteEnable]
set_max_capacitance 0.005 [get_ports LayerWriteSelect]
set_max_capacitance 0.005 [get_ports {WriteAddressSelect[9]}]
set_max_capacitance 0.005 [get_ports {WriteAddressSelect[8]}]
set_max_capacitance 0.005 [get_ports {WriteAddressSelect[7]}]
set_max_capacitance 0.005 [get_ports {WriteAddressSelect[6]}]
set_max_capacitance 0.005 [get_ports {WriteAddressSelect[5]}]
set_max_capacitance 0.005 [get_ports {WriteAddressSelect[4]}]
set_max_capacitance 0.005 [get_ports {WriteAddressSelect[3]}]
set_max_capacitance 0.005 [get_ports {WriteAddressSelect[2]}]
set_max_capacitance 0.005 [get_ports {WriteAddressSelect[1]}]
set_max_capacitance 0.005 [get_ports {WriteAddressSelect[0]}]
set_max_capacitance 0.005 [get_ports {writeIn[63]}]
set_max_capacitance 0.005 [get_ports {writeIn[62]}]
set_max_capacitance 0.005 [get_ports {writeIn[61]}]
set_max_capacitance 0.005 [get_ports {writeIn[60]}]
set_max_capacitance 0.005 [get_ports {writeIn[59]}]
set_max_capacitance 0.005 [get_ports {writeIn[58]}]
set_max_capacitance 0.005 [get_ports {writeIn[57]}]
set_max_capacitance 0.005 [get_ports {writeIn[56]}]
set_max_capacitance 0.005 [get_ports {writeIn[55]}]
set_max_capacitance 0.005 [get_ports {writeIn[54]}]
set_max_capacitance 0.005 [get_ports {writeIn[53]}]
set_max_capacitance 0.005 [get_ports {writeIn[52]}]
set_max_capacitance 0.005 [get_ports {writeIn[51]}]
set_max_capacitance 0.005 [get_ports {writeIn[50]}]
set_max_capacitance 0.005 [get_ports {writeIn[49]}]
set_max_capacitance 0.005 [get_ports {writeIn[48]}]
set_max_capacitance 0.005 [get_ports {writeIn[47]}]
set_max_capacitance 0.005 [get_ports {writeIn[46]}]
set_max_capacitance 0.005 [get_ports {writeIn[45]}]
set_max_capacitance 0.005 [get_ports {writeIn[44]}]
set_max_capacitance 0.005 [get_ports {writeIn[43]}]
set_max_capacitance 0.005 [get_ports {writeIn[42]}]
set_max_capacitance 0.005 [get_ports {writeIn[41]}]
set_max_capacitance 0.005 [get_ports {writeIn[40]}]
set_max_capacitance 0.005 [get_ports {writeIn[39]}]
set_max_capacitance 0.005 [get_ports {writeIn[38]}]
set_max_capacitance 0.005 [get_ports {writeIn[37]}]
set_max_capacitance 0.005 [get_ports {writeIn[36]}]
set_max_capacitance 0.005 [get_ports {writeIn[35]}]
set_max_capacitance 0.005 [get_ports {writeIn[34]}]
set_max_capacitance 0.005 [get_ports {writeIn[33]}]
set_max_capacitance 0.005 [get_ports {writeIn[32]}]
set_max_capacitance 0.005 [get_ports {writeIn[31]}]
set_max_capacitance 0.005 [get_ports {writeIn[30]}]
set_max_capacitance 0.005 [get_ports {writeIn[29]}]
set_max_capacitance 0.005 [get_ports {writeIn[28]}]
set_max_capacitance 0.005 [get_ports {writeIn[27]}]
set_max_capacitance 0.005 [get_ports {writeIn[26]}]
set_max_capacitance 0.005 [get_ports {writeIn[25]}]
set_max_capacitance 0.005 [get_ports {writeIn[24]}]
set_max_capacitance 0.005 [get_ports {writeIn[23]}]
set_max_capacitance 0.005 [get_ports {writeIn[22]}]
set_max_capacitance 0.005 [get_ports {writeIn[21]}]
set_max_capacitance 0.005 [get_ports {writeIn[20]}]
set_max_capacitance 0.005 [get_ports {writeIn[19]}]
set_max_capacitance 0.005 [get_ports {writeIn[18]}]
set_max_capacitance 0.005 [get_ports {writeIn[17]}]
set_max_capacitance 0.005 [get_ports {writeIn[16]}]
set_max_capacitance 0.005 [get_ports {writeIn[15]}]
set_max_capacitance 0.005 [get_ports {writeIn[14]}]
set_max_capacitance 0.005 [get_ports {writeIn[13]}]
set_max_capacitance 0.005 [get_ports {writeIn[12]}]
set_max_capacitance 0.005 [get_ports {writeIn[11]}]
set_max_capacitance 0.005 [get_ports {writeIn[10]}]
set_max_capacitance 0.005 [get_ports {writeIn[9]}]
set_max_capacitance 0.005 [get_ports {writeIn[8]}]
set_max_capacitance 0.005 [get_ports {writeIn[7]}]
set_max_capacitance 0.005 [get_ports {writeIn[6]}]
set_max_capacitance 0.005 [get_ports {writeIn[5]}]
set_max_capacitance 0.005 [get_ports {writeIn[4]}]
set_max_capacitance 0.005 [get_ports {writeIn[3]}]
set_max_capacitance 0.005 [get_ports {writeIn[2]}]
set_max_capacitance 0.005 [get_ports {writeIn[1]}]
set_max_capacitance 0.005 [get_ports {writeIn[0]}]
set_max_fanout 4 [get_ports reset]
set_max_fanout 4 [get_ports masterClk]
set_max_fanout 4 [get_ports inputsInbound]
set_max_fanout 4 [get_ports predictionRecieved]
set_max_fanout 4 [get_ports inputPixel]
set_max_fanout 4 [get_ports weightWriteEnable]
set_max_fanout 4 [get_ports biasWriteEnable]
set_max_fanout 4 [get_ports LayerWriteSelect]
set_max_fanout 4 [get_ports {WriteAddressSelect[9]}]
set_max_fanout 4 [get_ports {WriteAddressSelect[8]}]
set_max_fanout 4 [get_ports {WriteAddressSelect[7]}]
set_max_fanout 4 [get_ports {WriteAddressSelect[6]}]
set_max_fanout 4 [get_ports {WriteAddressSelect[5]}]
set_max_fanout 4 [get_ports {WriteAddressSelect[4]}]
set_max_fanout 4 [get_ports {WriteAddressSelect[3]}]
set_max_fanout 4 [get_ports {WriteAddressSelect[2]}]
set_max_fanout 4 [get_ports {WriteAddressSelect[1]}]
set_max_fanout 4 [get_ports {WriteAddressSelect[0]}]
set_max_fanout 4 [get_ports {writeIn[63]}]
set_max_fanout 4 [get_ports {writeIn[62]}]
set_max_fanout 4 [get_ports {writeIn[61]}]
set_max_fanout 4 [get_ports {writeIn[60]}]
set_max_fanout 4 [get_ports {writeIn[59]}]
set_max_fanout 4 [get_ports {writeIn[58]}]
set_max_fanout 4 [get_ports {writeIn[57]}]
set_max_fanout 4 [get_ports {writeIn[56]}]
set_max_fanout 4 [get_ports {writeIn[55]}]
set_max_fanout 4 [get_ports {writeIn[54]}]
set_max_fanout 4 [get_ports {writeIn[53]}]
set_max_fanout 4 [get_ports {writeIn[52]}]
set_max_fanout 4 [get_ports {writeIn[51]}]
set_max_fanout 4 [get_ports {writeIn[50]}]
set_max_fanout 4 [get_ports {writeIn[49]}]
set_max_fanout 4 [get_ports {writeIn[48]}]
set_max_fanout 4 [get_ports {writeIn[47]}]
set_max_fanout 4 [get_ports {writeIn[46]}]
set_max_fanout 4 [get_ports {writeIn[45]}]
set_max_fanout 4 [get_ports {writeIn[44]}]
set_max_fanout 4 [get_ports {writeIn[43]}]
set_max_fanout 4 [get_ports {writeIn[42]}]
set_max_fanout 4 [get_ports {writeIn[41]}]
set_max_fanout 4 [get_ports {writeIn[40]}]
set_max_fanout 4 [get_ports {writeIn[39]}]
set_max_fanout 4 [get_ports {writeIn[38]}]
set_max_fanout 4 [get_ports {writeIn[37]}]
set_max_fanout 4 [get_ports {writeIn[36]}]
set_max_fanout 4 [get_ports {writeIn[35]}]
set_max_fanout 4 [get_ports {writeIn[34]}]
set_max_fanout 4 [get_ports {writeIn[33]}]
set_max_fanout 4 [get_ports {writeIn[32]}]
set_max_fanout 4 [get_ports {writeIn[31]}]
set_max_fanout 4 [get_ports {writeIn[30]}]
set_max_fanout 4 [get_ports {writeIn[29]}]
set_max_fanout 4 [get_ports {writeIn[28]}]
set_max_fanout 4 [get_ports {writeIn[27]}]
set_max_fanout 4 [get_ports {writeIn[26]}]
set_max_fanout 4 [get_ports {writeIn[25]}]
set_max_fanout 4 [get_ports {writeIn[24]}]
set_max_fanout 4 [get_ports {writeIn[23]}]
set_max_fanout 4 [get_ports {writeIn[22]}]
set_max_fanout 4 [get_ports {writeIn[21]}]
set_max_fanout 4 [get_ports {writeIn[20]}]
set_max_fanout 4 [get_ports {writeIn[19]}]
set_max_fanout 4 [get_ports {writeIn[18]}]
set_max_fanout 4 [get_ports {writeIn[17]}]
set_max_fanout 4 [get_ports {writeIn[16]}]
set_max_fanout 4 [get_ports {writeIn[15]}]
set_max_fanout 4 [get_ports {writeIn[14]}]
set_max_fanout 4 [get_ports {writeIn[13]}]
set_max_fanout 4 [get_ports {writeIn[12]}]
set_max_fanout 4 [get_ports {writeIn[11]}]
set_max_fanout 4 [get_ports {writeIn[10]}]
set_max_fanout 4 [get_ports {writeIn[9]}]
set_max_fanout 4 [get_ports {writeIn[8]}]
set_max_fanout 4 [get_ports {writeIn[7]}]
set_max_fanout 4 [get_ports {writeIn[6]}]
set_max_fanout 4 [get_ports {writeIn[5]}]
set_max_fanout 4 [get_ports {writeIn[4]}]
set_max_fanout 4 [get_ports {writeIn[3]}]
set_max_fanout 4 [get_ports {writeIn[2]}]
set_max_fanout 4 [get_ports {writeIn[1]}]
set_max_fanout 4 [get_ports {writeIn[0]}]
