###################################################################

# Created by write_sdc on Thu Dec 20 12:12:03 2018

###################################################################
set sdc_version 1.7

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_area 0
set_driving_cell -lib_cell INVX1TS [get_ports clk]
set_driving_cell -lib_cell INVX1TS [get_ports resetInputQueue]
set_driving_cell -lib_cell INVX1TS [get_ports resetBuffer]
set_driving_cell -lib_cell INVX1TS [get_ports pixelValue]
set_driving_cell -lib_cell INVX1TS [get_ports dequeue]
set_driving_cell -lib_cell INVX1TS [get_ports writeBufferEnable]
set_load -pin_load 0.005 [get_ports finished]
set_load -pin_load 0.005 [get_ports {indexOut[9]}]
set_load -pin_load 0.005 [get_ports {indexOut[8]}]
set_load -pin_load 0.005 [get_ports {indexOut[7]}]
set_load -pin_load 0.005 [get_ports {indexOut[6]}]
set_load -pin_load 0.005 [get_ports {indexOut[5]}]
set_load -pin_load 0.005 [get_ports {indexOut[4]}]
set_load -pin_load 0.005 [get_ports {indexOut[3]}]
set_load -pin_load 0.005 [get_ports {indexOut[2]}]
set_load -pin_load 0.005 [get_ports {indexOut[1]}]
set_load -pin_load 0.005 [get_ports {indexOut[0]}]
set_load -pin_load 0.005 [get_ports queueEmpty]
set_max_capacitance 0.005 [get_ports clk]
set_max_capacitance 0.005 [get_ports resetInputQueue]
set_max_capacitance 0.005 [get_ports resetBuffer]
set_max_capacitance 0.005 [get_ports pixelValue]
set_max_capacitance 0.005 [get_ports dequeue]
set_max_capacitance 0.005 [get_ports writeBufferEnable]
set_max_fanout 4 [get_ports clk]
set_max_fanout 4 [get_ports resetInputQueue]
set_max_fanout 4 [get_ports resetBuffer]
set_max_fanout 4 [get_ports pixelValue]
set_max_fanout 4 [get_ports dequeue]
set_max_fanout 4 [get_ports writeBufferEnable]
set_ideal_network [get_ports clk]
create_clock [get_ports clk]  -period 1  -waveform {0 0.5}
set_clock_uncertainty 0  [get_clocks clk]
set_clock_transition -max -rise 0.01 [get_clocks clk]
set_clock_transition -max -fall 0.01 [get_clocks clk]
set_clock_transition -min -rise 0.01 [get_clocks clk]
set_clock_transition -min -fall 0.01 [get_clocks clk]
set_input_delay -clock clk  0.05  [get_ports resetInputQueue]
set_input_delay -clock clk  0.05  [get_ports resetBuffer]
set_input_delay -clock clk  0.05  [get_ports pixelValue]
set_input_delay -clock clk  0.05  [get_ports dequeue]
set_input_delay -clock clk  0.05  [get_ports writeBufferEnable]
set_output_delay -clock clk  0.05  [get_ports finished]
set_output_delay -clock clk  0.05  [get_ports {indexOut[9]}]
set_output_delay -clock clk  0.05  [get_ports {indexOut[8]}]
set_output_delay -clock clk  0.05  [get_ports {indexOut[7]}]
set_output_delay -clock clk  0.05  [get_ports {indexOut[6]}]
set_output_delay -clock clk  0.05  [get_ports {indexOut[5]}]
set_output_delay -clock clk  0.05  [get_ports {indexOut[4]}]
set_output_delay -clock clk  0.05  [get_ports {indexOut[3]}]
set_output_delay -clock clk  0.05  [get_ports {indexOut[2]}]
set_output_delay -clock clk  0.05  [get_ports {indexOut[1]}]
set_output_delay -clock clk  0.05  [get_ports {indexOut[0]}]
set_output_delay -clock clk  0.05  [get_ports queueEmpty]
