###################################################################

# Created by write_sdc on Thu Dec 20 12:07:08 2018

###################################################################
set sdc_version 1.7

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_fanout 4 [current_design]
set_max_area 0
set_driving_cell -lib_cell INVX1TS [get_ports reset]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[127]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[126]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[125]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[124]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[123]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[122]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[121]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[120]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[119]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[118]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[117]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[116]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[115]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[114]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[113]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[112]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[111]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[110]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[109]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[108]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[107]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[106]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[105]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[104]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[103]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[102]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[101]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[100]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[99]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[98]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[97]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[96]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[95]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[94]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[93]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[92]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[91]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[90]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[89]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[88]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[87]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[86]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[85]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[84]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[83]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[82]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[81]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[80]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[79]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[78]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[77]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[76]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[75]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[74]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[73]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[72]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[71]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[70]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[69]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[68]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[67]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[66]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[65]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[64]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[63]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[62]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[61]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[60]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[59]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[58]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[57]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[56]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[55]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[54]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[53]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[52]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[51]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[50]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[49]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[48]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[47]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[46]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[45]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[44]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[43]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[42]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[41]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[40]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[39]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[38]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[37]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[36]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[35]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[34]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[33]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[32]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[31]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[30]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[29]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[28]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[27]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[26]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[25]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[24]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[23]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[22]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[21]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[20]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[19]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[18]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[17]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[16]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[15]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[14]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[13]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[12]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[11]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[10]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[9]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[8]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[7]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[6]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[5]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[4]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[3]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[2]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[1]}]
set_driving_cell -lib_cell INVX1TS [get_ports {ReluNodeValues[0]}]
set_driving_cell -lib_cell INVX1TS [get_ports dequeue]
set_driving_cell -lib_cell INVX1TS [get_ports writeEnable]
set_load -pin_load 0.005 [get_ports {indexOut[2]}]
set_load -pin_load 0.005 [get_ports {indexOut[1]}]
set_load -pin_load 0.005 [get_ports {indexOut[0]}]
set_load -pin_load 0.005 [get_ports {NodeValueOut[3]}]
set_load -pin_load 0.005 [get_ports {NodeValueOut[2]}]
set_load -pin_load 0.005 [get_ports {NodeValueOut[1]}]
set_load -pin_load 0.005 [get_ports {NodeValueOut[0]}]
set_load -pin_load 0.005 [get_ports queueEmpty]
set_max_capacitance 0.005 [get_ports reset]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[127]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[126]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[125]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[124]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[123]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[122]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[121]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[120]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[119]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[118]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[117]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[116]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[115]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[114]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[113]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[112]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[111]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[110]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[109]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[108]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[107]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[106]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[105]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[104]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[103]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[102]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[101]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[100]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[99]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[98]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[97]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[96]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[95]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[94]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[93]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[92]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[91]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[90]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[89]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[88]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[87]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[86]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[85]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[84]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[83]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[82]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[81]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[80]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[79]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[78]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[77]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[76]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[75]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[74]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[73]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[72]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[71]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[70]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[69]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[68]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[67]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[66]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[65]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[64]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[63]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[62]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[61]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[60]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[59]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[58]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[57]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[56]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[55]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[54]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[53]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[52]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[51]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[50]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[49]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[48]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[47]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[46]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[45]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[44]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[43]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[42]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[41]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[40]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[39]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[38]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[37]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[36]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[35]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[34]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[33]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[32]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[31]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[30]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[29]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[28]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[27]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[26]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[25]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[24]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[23]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[22]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[21]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[20]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[19]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[18]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[17]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[16]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[15]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[14]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[13]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[12]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[11]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[10]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[9]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[8]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[7]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[6]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[5]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[4]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[3]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[2]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[1]}]
set_max_capacitance 0.005 [get_ports {ReluNodeValues[0]}]
set_max_capacitance 0.005 [get_ports dequeue]
set_max_capacitance 0.005 [get_ports writeEnable]
set_max_fanout 4 [get_ports reset]
set_max_fanout 4 [get_ports {ReluNodeValues[127]}]
set_max_fanout 4 [get_ports {ReluNodeValues[126]}]
set_max_fanout 4 [get_ports {ReluNodeValues[125]}]
set_max_fanout 4 [get_ports {ReluNodeValues[124]}]
set_max_fanout 4 [get_ports {ReluNodeValues[123]}]
set_max_fanout 4 [get_ports {ReluNodeValues[122]}]
set_max_fanout 4 [get_ports {ReluNodeValues[121]}]
set_max_fanout 4 [get_ports {ReluNodeValues[120]}]
set_max_fanout 4 [get_ports {ReluNodeValues[119]}]
set_max_fanout 4 [get_ports {ReluNodeValues[118]}]
set_max_fanout 4 [get_ports {ReluNodeValues[117]}]
set_max_fanout 4 [get_ports {ReluNodeValues[116]}]
set_max_fanout 4 [get_ports {ReluNodeValues[115]}]
set_max_fanout 4 [get_ports {ReluNodeValues[114]}]
set_max_fanout 4 [get_ports {ReluNodeValues[113]}]
set_max_fanout 4 [get_ports {ReluNodeValues[112]}]
set_max_fanout 4 [get_ports {ReluNodeValues[111]}]
set_max_fanout 4 [get_ports {ReluNodeValues[110]}]
set_max_fanout 4 [get_ports {ReluNodeValues[109]}]
set_max_fanout 4 [get_ports {ReluNodeValues[108]}]
set_max_fanout 4 [get_ports {ReluNodeValues[107]}]
set_max_fanout 4 [get_ports {ReluNodeValues[106]}]
set_max_fanout 4 [get_ports {ReluNodeValues[105]}]
set_max_fanout 4 [get_ports {ReluNodeValues[104]}]
set_max_fanout 4 [get_ports {ReluNodeValues[103]}]
set_max_fanout 4 [get_ports {ReluNodeValues[102]}]
set_max_fanout 4 [get_ports {ReluNodeValues[101]}]
set_max_fanout 4 [get_ports {ReluNodeValues[100]}]
set_max_fanout 4 [get_ports {ReluNodeValues[99]}]
set_max_fanout 4 [get_ports {ReluNodeValues[98]}]
set_max_fanout 4 [get_ports {ReluNodeValues[97]}]
set_max_fanout 4 [get_ports {ReluNodeValues[96]}]
set_max_fanout 4 [get_ports {ReluNodeValues[95]}]
set_max_fanout 4 [get_ports {ReluNodeValues[94]}]
set_max_fanout 4 [get_ports {ReluNodeValues[93]}]
set_max_fanout 4 [get_ports {ReluNodeValues[92]}]
set_max_fanout 4 [get_ports {ReluNodeValues[91]}]
set_max_fanout 4 [get_ports {ReluNodeValues[90]}]
set_max_fanout 4 [get_ports {ReluNodeValues[89]}]
set_max_fanout 4 [get_ports {ReluNodeValues[88]}]
set_max_fanout 4 [get_ports {ReluNodeValues[87]}]
set_max_fanout 4 [get_ports {ReluNodeValues[86]}]
set_max_fanout 4 [get_ports {ReluNodeValues[85]}]
set_max_fanout 4 [get_ports {ReluNodeValues[84]}]
set_max_fanout 4 [get_ports {ReluNodeValues[83]}]
set_max_fanout 4 [get_ports {ReluNodeValues[82]}]
set_max_fanout 4 [get_ports {ReluNodeValues[81]}]
set_max_fanout 4 [get_ports {ReluNodeValues[80]}]
set_max_fanout 4 [get_ports {ReluNodeValues[79]}]
set_max_fanout 4 [get_ports {ReluNodeValues[78]}]
set_max_fanout 4 [get_ports {ReluNodeValues[77]}]
set_max_fanout 4 [get_ports {ReluNodeValues[76]}]
set_max_fanout 4 [get_ports {ReluNodeValues[75]}]
set_max_fanout 4 [get_ports {ReluNodeValues[74]}]
set_max_fanout 4 [get_ports {ReluNodeValues[73]}]
set_max_fanout 4 [get_ports {ReluNodeValues[72]}]
set_max_fanout 4 [get_ports {ReluNodeValues[71]}]
set_max_fanout 4 [get_ports {ReluNodeValues[70]}]
set_max_fanout 4 [get_ports {ReluNodeValues[69]}]
set_max_fanout 4 [get_ports {ReluNodeValues[68]}]
set_max_fanout 4 [get_ports {ReluNodeValues[67]}]
set_max_fanout 4 [get_ports {ReluNodeValues[66]}]
set_max_fanout 4 [get_ports {ReluNodeValues[65]}]
set_max_fanout 4 [get_ports {ReluNodeValues[64]}]
set_max_fanout 4 [get_ports {ReluNodeValues[63]}]
set_max_fanout 4 [get_ports {ReluNodeValues[62]}]
set_max_fanout 4 [get_ports {ReluNodeValues[61]}]
set_max_fanout 4 [get_ports {ReluNodeValues[60]}]
set_max_fanout 4 [get_ports {ReluNodeValues[59]}]
set_max_fanout 4 [get_ports {ReluNodeValues[58]}]
set_max_fanout 4 [get_ports {ReluNodeValues[57]}]
set_max_fanout 4 [get_ports {ReluNodeValues[56]}]
set_max_fanout 4 [get_ports {ReluNodeValues[55]}]
set_max_fanout 4 [get_ports {ReluNodeValues[54]}]
set_max_fanout 4 [get_ports {ReluNodeValues[53]}]
set_max_fanout 4 [get_ports {ReluNodeValues[52]}]
set_max_fanout 4 [get_ports {ReluNodeValues[51]}]
set_max_fanout 4 [get_ports {ReluNodeValues[50]}]
set_max_fanout 4 [get_ports {ReluNodeValues[49]}]
set_max_fanout 4 [get_ports {ReluNodeValues[48]}]
set_max_fanout 4 [get_ports {ReluNodeValues[47]}]
set_max_fanout 4 [get_ports {ReluNodeValues[46]}]
set_max_fanout 4 [get_ports {ReluNodeValues[45]}]
set_max_fanout 4 [get_ports {ReluNodeValues[44]}]
set_max_fanout 4 [get_ports {ReluNodeValues[43]}]
set_max_fanout 4 [get_ports {ReluNodeValues[42]}]
set_max_fanout 4 [get_ports {ReluNodeValues[41]}]
set_max_fanout 4 [get_ports {ReluNodeValues[40]}]
set_max_fanout 4 [get_ports {ReluNodeValues[39]}]
set_max_fanout 4 [get_ports {ReluNodeValues[38]}]
set_max_fanout 4 [get_ports {ReluNodeValues[37]}]
set_max_fanout 4 [get_ports {ReluNodeValues[36]}]
set_max_fanout 4 [get_ports {ReluNodeValues[35]}]
set_max_fanout 4 [get_ports {ReluNodeValues[34]}]
set_max_fanout 4 [get_ports {ReluNodeValues[33]}]
set_max_fanout 4 [get_ports {ReluNodeValues[32]}]
set_max_fanout 4 [get_ports {ReluNodeValues[31]}]
set_max_fanout 4 [get_ports {ReluNodeValues[30]}]
set_max_fanout 4 [get_ports {ReluNodeValues[29]}]
set_max_fanout 4 [get_ports {ReluNodeValues[28]}]
set_max_fanout 4 [get_ports {ReluNodeValues[27]}]
set_max_fanout 4 [get_ports {ReluNodeValues[26]}]
set_max_fanout 4 [get_ports {ReluNodeValues[25]}]
set_max_fanout 4 [get_ports {ReluNodeValues[24]}]
set_max_fanout 4 [get_ports {ReluNodeValues[23]}]
set_max_fanout 4 [get_ports {ReluNodeValues[22]}]
set_max_fanout 4 [get_ports {ReluNodeValues[21]}]
set_max_fanout 4 [get_ports {ReluNodeValues[20]}]
set_max_fanout 4 [get_ports {ReluNodeValues[19]}]
set_max_fanout 4 [get_ports {ReluNodeValues[18]}]
set_max_fanout 4 [get_ports {ReluNodeValues[17]}]
set_max_fanout 4 [get_ports {ReluNodeValues[16]}]
set_max_fanout 4 [get_ports {ReluNodeValues[15]}]
set_max_fanout 4 [get_ports {ReluNodeValues[14]}]
set_max_fanout 4 [get_ports {ReluNodeValues[13]}]
set_max_fanout 4 [get_ports {ReluNodeValues[12]}]
set_max_fanout 4 [get_ports {ReluNodeValues[11]}]
set_max_fanout 4 [get_ports {ReluNodeValues[10]}]
set_max_fanout 4 [get_ports {ReluNodeValues[9]}]
set_max_fanout 4 [get_ports {ReluNodeValues[8]}]
set_max_fanout 4 [get_ports {ReluNodeValues[7]}]
set_max_fanout 4 [get_ports {ReluNodeValues[6]}]
set_max_fanout 4 [get_ports {ReluNodeValues[5]}]
set_max_fanout 4 [get_ports {ReluNodeValues[4]}]
set_max_fanout 4 [get_ports {ReluNodeValues[3]}]
set_max_fanout 4 [get_ports {ReluNodeValues[2]}]
set_max_fanout 4 [get_ports {ReluNodeValues[1]}]
set_max_fanout 4 [get_ports {ReluNodeValues[0]}]
set_max_fanout 4 [get_ports dequeue]
set_max_fanout 4 [get_ports writeEnable]
